Revit 2027 API
Document.DisplayUnitSystem Property
Provides access to display unit type with in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DisplayUnit DisplayUnitSystem { get; }
Public ReadOnly Property DisplayUnitSystem As DisplayUnit
	Get
public:
property DisplayUnit DisplayUnitSystem {
	DisplayUnit get ();
}
member DisplayUnitSystem : DisplayUnit with get
Property Value
DisplayUnit
Remarks
Return the display unit type, metric or imperial.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace